/*
  * find()
    - وبترجع أول عنصر يحقق الشرط فقط وبعدها تقف Array على عنصر عنصر من ال loop هى عبارة عن دالة بتعمل 
    - undefind لو مفيش عنصر حقق الشرط بترجع
  * filter()
    - موجود فيها كل العناصر الي حققت الشرط Array وبترجع Array على جميع العناصر الموجودة بداخل ال loop هى عبارة عن دالة بتعمل 
    - [] لو مفيش عنصر حقق الشرط بترجع

*/

/*
  * useMemo()
    - useMemo => useEffect يٌعاد رندرتها مرة أخرى وتعمتد على شرط معين للتغيير زيها زي ال  completedTodos او تغيير فى اى حاجة تانية ال render  علشان م مع كل  completedVariable يقوم بحفظ آخر قيمة انت طلعتها لل hook عبارة عن 
    - للكود الموجود بداخلها return علشان كدا لازم نعمل object ممكن تكون رقم أو مصفوفة أو  useMemo القيمة الي بترجع ال
*/